{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Clams",
    "1": "Corals",
    "2": "Crabs",
    "3": "Dolphin",
    "4": "Eel",
    "5": "Fish",
    "6": "Jelly Fish",
    "7": "Lobster",
    "8": "Nudibranchs",
    "9": "Octopus",
    "10": "Otter",
    "11": "Penguin",
    "12": "Puffers",
    "13": "Sea Rays",
    "14": "Sea Urchins",
    "15": "Seahorse",
    "16": "Seal",
    "17": "Sharks",
    "18": "Shrimp",
    "19": "Squid",
    "20": "Starfish",
    "21": "Turtle_Tortoise",
    "22": "Whale"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Clams": 0,
    "Corals": 1,
    "Crabs": 2,
    "Dolphin": 3,
    "Eel": 4,
    "Fish": 5,
    "Jelly Fish": 6,
    "Lobster": 7,
    "Nudibranchs": 8,
    "Octopus": 9,
    "Otter": 10,
    "Penguin": 11,
    "Puffers": 12,
    "Sea Rays": 13,
    "Sea Urchins": 14,
    "Seahorse": 15,
    "Seal": 16,
    "Sharks": 17,
    "Shrimp": 18,
    "Squid": 19,
    "Starfish": 20,
    "Turtle_Tortoise": 21,
    "Whale": 22
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.2"
}
